/*-------------------------------------------------------------------------

 DateTimeを使った시간測定
 精度はよくわからんが, PC기동시간に影響されない

---------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------
 using
---------------------------------------------------------------------------*/
using System;

/*-------------------------------------------------------------------------
 
---------------------------------------------------------------------------*/
namespace Utility
{
	/*-------------------------------------------------------------------------
	 
	---------------------------------------------------------------------------*/
	public sealed class DateTimer
	{
		private DateTime			m_elapsed_time_tmp;
		private DateTime			m_section_time_tmp;

		/*-------------------------------------------------------------------------
		 
		---------------------------------------------------------------------------*/
		public DateTimer()
		{
			m_elapsed_time_tmp		= DateTime.Now;
			m_section_time_tmp		= DateTime.Now;
		}

		/*-------------------------------------------------------------------------
		 前회からの経過시간を得る
		 ミリセカンドで得る
		 1000 == 1초
		---------------------------------------------------------------------------*/
		public int GetElapsedTimeMilliseconds()
		{
			DateTime	t		= DateTime.Now;
			int			e		= (int)(TimeSpan.FromTicks(sub_date_time(t, m_elapsed_time_tmp)).TotalMilliseconds);
			m_elapsed_time_tmp	= t;
			return e;
		}

		/*-------------------------------------------------------------------------
		 区間経過시간
		 計測開始
		---------------------------------------------------------------------------*/
		public void StartSection()
		{
			m_section_time_tmp		= DateTime.Now;
		}

		/*-------------------------------------------------------------------------
		 計測開始からの経過시간
		 1000 == 1초
		---------------------------------------------------------------------------*/
		public int GetSectionTimeMilliseconds()
		{
			return (int)(TimeSpan.FromTicks(sub_date_time(DateTime.Now, m_section_time_tmp)).TotalMilliseconds);
		}

		/*-------------------------------------------------------------------------
		 差を得る
		 a - b を返す
		---------------------------------------------------------------------------*/
		static private long sub_date_time(DateTime a, DateTime b)
		{
			return a.Ticks - b.Ticks;
		}
	}
}
