/*-------------------------------------------------------------------------

 DateTime 을 사용한 시간 측정
 정밀도는 잘 모르겠지만, PC 기동 시간에 영향받지 않는다

---------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------
 using
---------------------------------------------------------------------------*/
using System;

/*-------------------------------------------------------------------------
 
---------------------------------------------------------------------------*/
namespace Utility
{
	/*-------------------------------------------------------------------------
	 
	---------------------------------------------------------------------------*/
	public sealed class DateTimer
	{
		private DateTime			m_elapsed_time_tmp;
		private DateTime			m_section_time_tmp;

		/*-------------------------------------------------------------------------
		 
		---------------------------------------------------------------------------*/
		public DateTimer()
		{
			m_elapsed_time_tmp		= DateTime.Now;
			m_section_time_tmp		= DateTime.Now;
		}

		/*-------------------------------------------------------------------------
		 지난번부터의 경과 시간을 얻는다
		 밀리세컨드로 얻는다
		 1000 == 1초
		---------------------------------------------------------------------------*/
		public int GetElapsedTimeMilliseconds()
		{
			DateTime	t		= DateTime.Now;
			int			e		= (int)(TimeSpan.FromTicks(sub_date_time(t, m_elapsed_time_tmp)).TotalMilliseconds);
			m_elapsed_time_tmp	= t;
			return e;
		}

		/*-------------------------------------------------------------------------
		 구간 경과 시간
		 계측 시작
		---------------------------------------------------------------------------*/
		public void StartSection()
		{
			m_section_time_tmp		= DateTime.Now;
		}

		/*-------------------------------------------------------------------------
		 측정 시작부터의 경과 시간
		 1000 == 1초
		---------------------------------------------------------------------------*/
		public int GetSectionTimeMilliseconds()
		{
			return (int)(TimeSpan.FromTicks(sub_date_time(DateTime.Now, m_section_time_tmp)).TotalMilliseconds);
		}

		/*-------------------------------------------------------------------------
		 차이를 얻는다
		 a - b 를 반환한다
		---------------------------------------------------------------------------*/
		static private long sub_date_time(DateTime a, DateTime b)
		{
			return a.Ticks - b.Ticks;
		}
	}
}
