/*-------------------------------------------------------------------------

 이자로부터의 경과 일수
 완전한 경과 일수가 되지는 않을 수 있지만,
 허용 범위의 정확도는 유지된다

---------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------
 define
---------------------------------------------------------------------------*/
//#define	DEBUG_POPUP_STRING

/*-------------------------------------------------------------------------
 using
---------------------------------------------------------------------------*/
using System;
using System.Collections.Generic;
using System.Text;

/*-------------------------------------------------------------------------
 
---------------------------------------------------------------------------*/
namespace gvtrademap_cs
{
	/*-------------------------------------------------------------------------
	 
	---------------------------------------------------------------------------*/
	public class interest_days : gvo_day_counter
	{
		private GlobalSettings						m_setting;

		/*-------------------------------------------------------------------------
		 
		---------------------------------------------------------------------------*/

		/*-------------------------------------------------------------------------
		 
		---------------------------------------------------------------------------*/
		public interest_days(GlobalSettings _setting)
			: base()
		{
			m_setting				= _setting;
			base.Days				= m_setting.interest_days;
		}

		/*-------------------------------------------------------------------------
		 업데이트
		---------------------------------------------------------------------------*/
		public void Update(int days, bool is_interest)
		{
			// 일수 카운트 갱신
			base.UpdateBase(days);

			if(is_interest){
				// 이자가 들어왔다
				base.Reset(days);		// 카운터리셋
			}

			// 설정 저장용으로 기억해 둔다
			m_setting.interest_days		= base.get_true_days();
		}

		/*-------------------------------------------------------------------------
		 수동으로 초기화한다
		 로그로 이자를 확인할 수 없을 때 사용한다
		---------------------------------------------------------------------------*/
		public void ManualReset()
		{
			base.Reset();
			m_setting.interest_days		= base.get_true_days();
		}

		/*-------------------------------------------------------------------------
		 팝업용 문자열을 얻는다
		---------------------------------------------------------------------------*/
		public string GetPopupString()
		{
			if(GetDays() > 30){
				// 30 일을 넘었다
				// 
				return "30일 이상이 지났습니다.\n현재의 경과일수는 신뢰할수 없습니다.\n이자 받는 날을 정상으로 초기화합니다.";
			}else{
#if DEBUG_POPUP_STRING
				return String.Format("남은 {0}일\n{1}일 항해중\n시작 {2}\n현재 {3}",
										30 - GetDays(),
										base.VoyageDays - base.VoyageDaysStart,
										base.VoyageDaysStart,
										base.VoyageDays);
#else
				return String.Format("남은{0}일\n{1}일항해중",
										30 - GetDays(),
										base.VoyageDays - base.VoyageDaysStart);
#endif
			}
		}
	}
}
