/*-------------------------------------------------------------------------

 이자からの경과일수
 完全な경과일수とはならない可能性があるが, 
 허용범위の精도は保てる

---------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------
 define
---------------------------------------------------------------------------*/
//#define	DEBUG_POPUP_STRING

/*-------------------------------------------------------------------------
 using
---------------------------------------------------------------------------*/
using System;
using System.Collections.Generic;
using System.Text;

/*-------------------------------------------------------------------------
 
---------------------------------------------------------------------------*/
namespace gvtrademap_cs
{
	/*-------------------------------------------------------------------------
	 
	---------------------------------------------------------------------------*/
	public class interest_days : gvo_day_counter
	{
		private GlobalSettings						m_setting;

		/*-------------------------------------------------------------------------
		 
		---------------------------------------------------------------------------*/

		/*-------------------------------------------------------------------------
		 
		---------------------------------------------------------------------------*/
		public interest_days(GlobalSettings _setting)
			: base()
		{
			m_setting				= _setting;
			base.Days				= m_setting.interest_days;
		}

		/*-------------------------------------------------------------------------
		 업데이트
		---------------------------------------------------------------------------*/
		public void Update(int days, bool is_interest)
		{
			// 일수カウントの업데이트
			base.UpdateBase(days);

			if(is_interest){
				// 이자が来た
				base.Reset(days);		// 카운터리셋
			}

			// 설정保存用に覚えておく
			m_setting.interest_days		= base.get_true_days();
		}

		/*-------------------------------------------------------------------------
		 ポップアップ用の文字列を得る
		---------------------------------------------------------------------------*/
		public string GetPopupString()
		{
			if(GetDays() > 30){
				// 30日を超えてる
				// 
				return "30日이상경과しました\n현재の경과일수は信頼できません\n이자を受け取ると正常にもどります";
			}else{
#if DEBUG_POPUP_STRING
				return String.Format("残り{0}日\n{1}日항해중\n開始{2}\n현재{3}",
										30 - GetDays(),
										base.VoyageDays - base.VoyageDaysStart,
										base.VoyageDaysStart,
										base.VoyageDays);
#else
				return String.Format("残り{0}日\n{1}日항해중",
										30 - GetDays(),
										base.VoyageDays - base.VoyageDaysStart);
#endif
			}
		}
	}
}
