/*-------------------------------------------------------------------------

 이자からの경과일수
 完全な경과일수とはならない가능性があるが, 
 허용범위の정확도は保てる

---------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------
 define
---------------------------------------------------------------------------*/
//#define	DEBUG_POPUP_STRING

/*-------------------------------------------------------------------------
 using
---------------------------------------------------------------------------*/
using System;
using System.Collections.Generic;
using System.Text;

/*-------------------------------------------------------------------------
 
---------------------------------------------------------------------------*/
namespace gvtrademap_cs
{
	/*-------------------------------------------------------------------------
	 
	---------------------------------------------------------------------------*/
	public class interest_days : gvo_day_counter
	{
		private GlobalSettings						m_setting;

		/*-------------------------------------------------------------------------
		 
		---------------------------------------------------------------------------*/

		/*-------------------------------------------------------------------------
		 
		---------------------------------------------------------------------------*/
		public interest_days(GlobalSettings _setting)
			: base()
		{
			m_setting				= _setting;
			base.Days				= m_setting.interest_days;
		}

		/*-------------------------------------------------------------------------
		 업데이트
		---------------------------------------------------------------------------*/
		public void Update(int days, bool is_interest)
		{
			// 일수カウントの업데이트
			base.UpdateBase(days);

			if(is_interest){
				// 이자が来た
				base.Reset(days);		// 카운터리셋
			}

			// 설정保存용に覚えておく
			m_setting.interest_days		= base.get_true_days();
		}

		/*-------------------------------------------------------------------------
		 ポップアップ용の문자열を得る
		---------------------------------------------------------------------------*/
		public string GetPopupString()
		{
			if(GetDays() > 30){
				// 30일を超えてる
				// 
				return "30일 이상이 지났습니다.\n현재의 경과일수는 신뢰할수 없습니다.\n이자를 받는 날을 정상으로 초기화합니다.";
			}else{
#if DEBUG_POPUP_STRING
				return String.Format("残り{0}일\n{1}일항해중\n開始{2}\n현재{3}",
										30 - GetDays(),
										base.VoyageDays - base.VoyageDaysStart,
										base.VoyageDaysStart,
										base.VoyageDays);
#else
				return String.Format("남은{0}일\n{1}일항해중",
										30 - GetDays(),
										base.VoyageDays - base.VoyageDaysStart);
#endif
			}
		}
	}
}
