/*-------------------------------------------------------------------------

 バージョン情報

---------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------
 using
---------------------------------------------------------------------------*/
using System.Windows.Forms;
using System.Diagnostics;

/*-------------------------------------------------------------------------

---------------------------------------------------------------------------*/
namespace gvtrademap_cs
{
	/*-------------------------------------------------------------------------

	---------------------------------------------------------------------------*/
	public partial class version_form : Form
	{
		/*-------------------------------------------------------------------------

		---------------------------------------------------------------------------*/
		public version_form(string version_str)
		{
			InitializeComponent();
			useful.useful.SetFontMeiryo(this, def.MEIRYO_POINT);

			label1.Text		= version_str;
		}

		/*-------------------------------------------------------------------------
		 HPを開く
		---------------------------------------------------------------------------*/
		private void linkLabel1_LinkClicked(object sender, LinkLabelLinkClickedEventArgs e)
		{
			Process.Start("http://showroom256.hp.infoseek.co.jp/");
			linkLabel1.LinkVisited	= true;
		}

		/*-------------------------------------------------------------------------
		 HPを開く
		 大航海時代Online ツール配布所
		---------------------------------------------------------------------------*/
		private void linkLabel2_LinkClicked(object sender, LinkLabelLinkClickedEventArgs e)
		{
			Process.Start("http://gvtrademap.daa.jp/");
			linkLabel2.LinkVisited	= true;
		}
	}
}
